[
  {
    "event": "Cascadia Art Museum",
    "TrevWork (combined exhibits and dates)": "“Dreaming Forms: The Art of Leo Kenney”;  “Stolen Moments: The Photography of Shedrich Williames”; all current exhibits run through May 23",
    "exhibitname": "“Dreaming Forms: The Art of Leo Kenney”;  “Stolen Moments: The Photography of Shedrich Williames”",
    "dates": "All current exhibits run through May 23",
    "category": "Visual Arts",
    "price": "$10 adults, $7 seniors, free for youth under 18 and students",
    "location": "190 Sunset Ave. S., Suite E, Edmonds",
    "website_online": "http://www.cascadiaartmuseum.org/",
    "phone": "425-336-4809",
    "hours": "Thursday-Sunday, noon-5 p.m.",
    "vignette": "This Edmonds museum, a stone’s throw from the ferry, attracted much attention in 2019 for its exhibit “The Lavender Palette,” which featured work by early-to-mid-20th-century gay and lesbian artists from the Pacific Northwest. Curated by David Martin, the show was a groundbreaking exploration of regional culture through the work of gay creators.\n\nReopened since February, the museum focuses on Northwest artists from 1860 through 1970. It is currently presenting “Dreaming Forms: The Art of Leo Kenney,” a collection of work from the acclaimed Northwest abstract painter (1925-2001), and “Stolen Moments: The Photography of Shedrich Williames,” the first solo exhibit from the long-based-in-Portland photographer. Also on view is a selection of work from the museum’s permanent collection, including several paintings by Guy Anderson (1906-1998) — himself an Edmonds native son.",
    "author": "Moira Macdonald",
    "photocredit": "University of Washington Libraries, Special Collections",
    "region": "North",
    "photo": "assets/cascadia2.jpg",
    "cutline": "Shedrich Williames’ “Self Portrait” is part of the “Stolen Moments: The Photography of Shedrich Williames” exhibit at Cascadia Art Museum. ",
    "safety": "Masks and physical distancing required, no more than 50 patrons at a time",
    "TREV NOTES": "Exhibit names seem kinda problematic, many museums have far too many exhibitions to name"
  },
  {
    "event": "Frye Art Museum",
    "TrevWork (combined exhibits and dates)": "“(Don’t Be Absurd) Alice in Parts” through April 25; “Unsettling Femininity” through May 30; “Art on the Mind” through Nov. 14",
    "exhibitname": "“(Don’t Be Absurd) Alice in Parts”; “Unsettling Femininity”; “Art on the Mind” ",
    "dates": "“(Don’t Be Absurd) Alice in Parts” through April 25; “Unsettling Femininity” through May 30; “Art on the Mind” through Nov. 14",
    "category": "Visual Arts",
    "price": "Free (timed ticket required)",
    "location": "704 Terry Ave., Seattle",
    "website_online": "fryemuseum.org ",
    "phone": "206-622-9250",
    "hours": "Thursday-Sunday, 11 a.m.-5 p.m.",
    "vignette": "The venerable Frye first opened its doors in 1952, the legacy of Charles and Emma Frye, two local art patrons and prominent citizens who left their vast collection in perpetuity to the people of Seattle. In keeping with that spirit, admission to the Frye is always free; these days, however, you need a timed ticket.\n\nNow reopened in its longtime First Hill location, the Frye is offering new work from local interdisciplinary artist Anastacia-Reneé, whose 3D tour “(Don’t be Absurd) Alice in Parts” is described as “a rageful meditation on gentrification and its insidious effects on the body and home, as seen through the eyes of her multilayered character Alice Metropolis.” A former Seattle Civic Poet whose work examines racism, sexism, homophobia, ageism and class, Anastacia-Reneé designed this immersive exhibit to feel like a walk through Alice’s home. Also on display: “Unsettling Femininity,” drawn from the Frye’s collection of late-19th and early-20th-century paintings, examines how we look at women; “Art on the Mind: Ten Years of Creative Aging” celebrates the Frye’s decade of programs connecting people with dementia and their caregivers with art.",
    "author": "Moira Macdonald",
    "photocredit": "Jueqian Fang",
    "region": "Seattle",
    "photo": "assets/frye.jpg",
    "cutline": "Installation view of Anastacia-Reneé’s “(Don’t be Absurd) Alice in Parts” at Frye Art Museum. ",
    "safety": "Timed tickets, masks and physical distancing required, coat check/cafe/shop closed, temperature checks and symptom screenings on entry"
  },
  {
    "event": "Greg Kucera Gallery",
    "TrevWork (combined exhibits and dates)": "Exhibits of Jacob Lawrence’s and Joey Veltkamp’s works, through April 17",
    "exhibitname": "Jacob Lawrence and Joey Veltkamp",
    "dates": "Jacob Lawrence and Joey Veltkamp run through April 17 ",
    "category": "Visual Arts",
    "price": "Free ",
    "location": "212 Third Ave. S., Seattle",
    "website_online": "gregkucera.com ",
    "phone": "206-624-0770",
    "hours": "Tuesday-Saturday, 10:30 a.m.-5:30 p.m.",
    "vignette": "We’ve written before about works by the rightly beloved Jacob Lawrence at Greg Kucera Gallery: the bold colors and iconic images of builders, families and snapshots from the life of Haitian revolutionary Toussaint Louverture. There’s no reason not to see those. \n\nExuberant fabric works by local artist Joey Veltkamp are also currently hanging at Kucera. Veltkamp stitches life itself into his quilts: dread, humor, delight. The showstopper might be “Life Is Beautiful,” an enormous, pink blanket shouting “WE’RE ALL GONNA DIE” in black letters. But if you snuggle up close to the memento mori, you’ll find more hopeful messages in pink thread: “I will always love you,” “we are your friends,” etc. Other quilts feature sea gulls at Ivar’s, signs he sees around his home across the water in Bremerton (“come in for your free rose, Ben”) and a series of American-flag-themed quilts. One, “Self-Portrait as America,” features the stars and stripes unravelling — or on fire. He made that in 2020.",
    "author": "Brendan Kiley",
    "photocredit": "Courtesy of Greg Kucera Gallery",
    "region": "Seattle",
    "photo": "assets/kucera.jpg",
    "cutline": "The quilts and fabric art of Joey Veltkamp, currently hanging at Greg Kucera Gallery, include a series of meditations on American flags — some waving in celebration and some in distress.",
    "safety": "Masks and physical distancing required"
  },
  {
    "event": "MadArt\n\n",
    "TrevWork (combined exhibits and dates)": "“Parable of Gravity,” through April 17  ",
    "exhibitname": "“Parable of Gravity” ",
    "dates": "“Parable of Gravity” through April 17",
    "category": "Visual Arts",
    "price": "Free (timed tickets required)",
    "location": "325 Westlake Ave. N., Suite 101, Seattle",
    "website_online": "madartseattle.com",
    "phone": "206-623-1180",
    "hours": "Monday-Saturday 10 a.m.-4 p.m.",
    "vignette": "MadArt is a big room in South Lake Union where, every few months, an artist (or a team) makes the kind of ambitious installations you don’t tend to see elsewhere. Descriptions only get you so far (you can describe what a roller coaster looks like, but will fail to communicate the feeling of being one grain in a whirlwind), but let’s try: “Aperture” by Ian McMahon was a 15-foot-tall plaster pillow trying to burst through a wood frame. “Each and Every” by Beili Liu, with its hundreds of children’s clothes coated in cement and suspended above the floor (a comment on children trapped in limbo at the U.S./Mexico border) was deep and dissonant, like a graveyard for infants, or a requiem played on recorders and toy pianos. MadArt’s current exhibition is “Parable of Gravity” by Casey Curran, whose work has been at the Guggenheim, onstage with provocateurs Saint Genet, and on the runway at 2021 Paris Haute Couture Week. Curran’s parable is of catastrophe and rebirth: spare wood towers in various stages of rot; a giant metal meteor with a Gothic cathedral’s rose window; and feathery white animatronic plants (or are they fungus?) barnacled on the crumbling high-rises, slowly opening and closing, like they’re supplicating to the incoming space rock, or talking to each other. If you read Curran’s creation as a vision of an eviscerated city, the parable is terrifying — but if you can step outside your anthropocentrism, it’s beautiful. What strange beings will thrive on our bones?\n\n\n\n",
    "author": "Brendan Kiley",
    "photocredit": "James Harnois and MadArt",
    "region": "Seattle",
    "photo": "assets/madart.jpg",
    "cutline": "The impressive “Parable of Gravity,” at MadArt Studio, is a large-scale installation of buildings in decay, an approaching meteor and masses of animatronic flowerlike creatures slowly opening and closing. ",
    "safety": "Timed tickets, masks and physical distancing required, groups limited to 15"
  },
  {
    "event": "Martyr Sauce",
    "TrevWork (combined exhibits and dates)": "New space opening May 6, 2021; upcoming exhibit featuring muralist Kenji Stoll, dates and title forthcoming",
    "dates": "New space opening May 6, 2021",
    "category": "Visual Arts",
    "price": "$5",
    "location": "108 S. Jackson St., Seattle",
    "website_online": "martyrsauce.com/",
    "phone": "contact@martyrsauce.com",
    "hours": "Thursday-Saturday by appointment",
    "vignette": "With her colorful, larger-than-life installations, Tariqa Waters — artist, curator and founder of the gallery Martyr Sauce — is always one to watch. And that’s about to get a whole lot easier now that Martyr Sauce is relaunching in a new space this May. The new space is above ground (as opposed to the original, very cool but underground space in Pioneer Square) and features large windows which Waters says she’ll take full advantage of by curating and creating large enticing installations that you’ll be able to enjoy from the street. (The original Martyr Sauce space will have new programming, too, after the pandemic eases.) In the new space, Waters will commission artists in collaborative works that she calls “transformative and immersive experiences through public engagement.” First up is Tacoma-based visual artist and muralist Kenji Stoll. “You won’t have to enter the space,” said Waters. “You can soak it up from the street and when you come inside, it’s a treat.”\n\n",
    "author": "Crystal Paul ",
    "photocredit": "Dean Rutz / The Seattle Times",
    "region": "Seattle",
    "photo": "assets/martyrsauce.jpg",
    "cutline": "Tariqa Waters, artist, curator, and owner of Martyr Sauce art gallery in Pioneer Square, which is expanding its footprint. ",
    "safety": "Masks required"
  },
  {
    "event": "Museum of Glass",
    "TrevWork (combined exhibits and dates)": "“Transparency,” through summer; “René Lalique: Art Deco Gems from the Steven and Roslyn Shulman Collection,” through fall; “Counterparts,” as of this writing, does not have a closing date ",
    "exhibitname": "“Transparency”; “René Lalique: Art Deco Gems from the Steven and Roslyn Shulman Collection”; “Counterparts”",
    "dates": "“Transparency” shows through summer; “René Lalique” through fall; “Counterparts,” as of this writing, does not have a closing date ",
    "category": "Visual Arts",
    "price": "$17 adults, $14 seniors/students/military, $5 12 and under; ",
    "location": "1801 Dock St., Tacoma",
    "website_online": "museumofglass.org ",
    "phone": "253-284-4750  ",
    "hours": "Friday-Sunday 10 a.m.-5 p.m.",
    "vignette": "Art glass is the delicious candy of the museum world; colorful, shiny, accessible and oddly soothing, like magic icicles. Tacoma’s Museum of Glass, which reopened April 3, puts art glass and glassmaking at center stage, letting its beautifully lit wares sparkle. It’ll feature three exhibits this spring: “Transparency,” a collection of glassworks created by LGBTQ+ artists (created by the National Liberty Museum in Philadelphia for Pride Month 2017); a delicate assortment of nearly 200 art deco objects from the French artist René Lalique; and “Counterparts: Glass + Art Elements,” in which glass and nonglass works are juxtaposed to illustrate common themes.\n\n",
    "author": "Moira Macdonald",
    "photocredit": "Courtesy of Museum of Glass",
    "region": "South",
    "photo": "assets/glass.jpg",
    "cutline": "“René Lalique: Art Deco Gems from the Steven and Roslyn Shulman Collection” at Museum of Glass in Tacoma includes nearly 200 art deco objects from the French artist René Lalique. ",
    "safety": "Masks and physical distancing required, staggered entry may be implemented, Education Studio closed"
  },
  {
    "event": "Seattle Art Museum",
    "TrevWork (combined exhibits and dates)": "“Jacob Lawrence: The American Struggle,” through May 23; “Barbara Earl Thomas: The Geography of Innocence,” through Jan. 2, 2022; “Dawn Cerny: Les Choses,” April 9 through Sept. 26; “Monet at Étretat,” June 25 through Oct. 17",
    "exhibitname": "“Jacob Lawrence: The American Struggle”; “Barbara Earl Thomas: The Geography of Innocence”; “Dawn Cerny: Les Choses”; “Monet at Étretat”",
    "dates": "“The American Struggle” through May 23; “The Geography of Innocence” through Nov. 14; “Les Choses,” April 9 through Sept. 26; “Monet at Étretat,” June 25 through Oct. 17",
    "category": "Visual Arts",
    "price": "$19.99 adults, $17.99 seniors 65 and over and military, $12.99 teens and students, free for SAM members, children 14 and under, free on first Thursday of each month",
    "location": "1300 First Ave., Seattle",
    "website_online": "seattleartmuseum.org",
    "phone": "206-654-3100",
    "hours": "Friday-Sunday 10 a.m.-5 p.m., First Free Thursday 10 a.m.-5p.m.",
    "vignette": "If you need an injection of art appreciation posthaste, Seattle Art Museum has a wealth of fantastic shows on view, from celebrated artists with ties to Seattle. “Jacob Lawrence: The American Struggle” is frequently sold-out, and for good reason. For the first time since 1958, the exhibition reunites Lawrence’s iconic series “Struggle: From the History of the American People,” and its quasi-abstract epic of American history told through the eyes of folks previously pushed to the margins. Also on view is Barbara Earl Thomas’ stunning “The Geography of Innocence.” Through cut-paper portraits and an immersive installation, the show invites viewers to reflect on childhood, race, violence, hope, ritual and their own lives and potential for change. \n\nIn June, “Monet at Étretat” presents a chance to immerse yourself in the impressionist’s French coastal town without stepping on a plane; and sculptures from Dawn Cerny in the exhibition “Les Choses” examine “the gap between our ideal homes and the lived reality of our overgrown, patched-up, and slightly worn habitats,” something that couldn’t be more timely after a year spent getting intimately acquainted with our own slightly worn habitats.\n(SAM’s Asian Art Museum reopens to the public on May 28, and to SAM members on May 7. Its Olympic Sculpture Park is open, though the PACCAR Pavilion at the park remains closed.)",
    "author": "Megan Burbank",
    "photocredit": "Courtesy of Seattle Art Museum",
    "region": "Seattle",
    "photo": "assets/sam.jpg",
    "cutline": "In June, SAM’s “Monet at Étretat” presents a chance to immerse yourself in the impressionist’s French coastal town without stepping on a plane. ",
    "safety": "Timed tickets, masks and physical distancing required, capacity limits (some galleries closed), coat check closed"
  },
  {
    "event": "Tacoma Art Museum",
    "TrevWork (combined exhibits and dates)": "“Immigrant Artists”; “Painting Deconstructed”; as of this writing, neither exhibition has a closing date",
    "exhibitname": "“Immigrant Artists”; “Painting Deconstructed”",
    "dates": "“Immigrant Artists” and “Painting Deconstructed,” as of this writing, do not have closing dates",
    "category": "Visual Arts",
    "price": "$18 adults, $15 students/seniors, free for military and children 5 and under",
    "location": "1701 Pacific Ave., Tacoma",
    "website_online": "tacomaartmuseum.org",
    "phone": "253-272-4258",
    "hours": "Friday-Sunday, 10 a.m.-5 p.m.",
    "vignette": "Founded in 1935, Tacoma’s largest museum has a permanent collection of more than 5,000 works. Reopening in April 16, it will have a variety of exhibits on display. “Immigrant Artists and the American West” examines how immigrant experiences are shaped by art; its artists, arriving in the 19th and 20th centuries, come from China, Denmark, England, France, Germany, Japan, Mexico and Russia, among other countries. “Painting Deconstructed: Selections from the Northwest Collection” is made of work by Black and Indigenous artists, artists of color, and women artists, divided into sections highlighting four key aspects of painting: medium and support, composition, color, and technique. There’s also a permanent Dale Chihuly glasswork collection, an array of outdoor sculptures, and “South Sound Selects: Community Choices from the Collection,” in which members of the South Sound community served as guest curators and chose their favorite works to display. \n\n",
    "author": "Moira Macdonald",
    "photocredit": "Courtesy of Tacoma Art Museum",
    "region": "South",
    "photo": "assets/tacoma.jpg",
    "cutline": "“Gymnasium,” an oil painting by Kenjiro Nomura (1896-1956), is part of the “Immigrant Artists and the American West” exhibit on display at Tacoma Art Museum, reopening April 16. ",
    "safety": "Masks and physical distancing required; Art Studio, TAM Cafe, coat check and hands-on exhibits temporarily closed; museum store restricted to 10 visitors"
  },
  {
    "event": "Wa Na Wari",
    "TrevWork (combined exhibits and dates)": "Exhibits of Carletta Carrington Wilson’s, Lisa Myers Bulmash’s, Mia Imani’s, Shoccara Marcus’s and Kyle Yearwood’s works, through July 18",
    "exhibitname": "Carletta Carrington Wilson; Lisa Myers Bulmash; Mia Imani; Shoccara Marcus; Kyle Yearwood  ",
    "dates": "Carletta Carrington Wilson, Lisa Myers Bulmash, Mia Imani, Shoccara Marcus and Kyle Yearwood exhibits through July 18",
    "category": "Visual Arts",
    "price": "Free",
    "location": "911 24th Ave., Seattle",
    "website_online": "wanawari.org",
    "phone": "206-485-7563",
    "hours": "By appointment",
    "vignette": "Housed in a fifth-generation Black-owned home in the Central District, Wa Na Wari showcases work from Black artists in a multidisciplinary space that invites (and rewards) deep engagement. This spring’s offerings bring a strongly felt sense of place and history, from Carletta Carrington Wilson’s mixed-media “night of the stereotypes,” in which 19th- and 20th-century caricatures interrogate the work of their racist creators, to collage and book artist Lisa Myers Bulmash’s “The Memory Palace,” which pushes back against the normative idea that COVID-19 is truly novel: “How can this be ‘an unprecedented moment in history’ when Black people have seen — and survived — even worse? We are so often the first to be hit by tragedy.” In “Choreographing My Past,” Shoccara Marcus documents the dissonance of returning to her childhood home after a decade away “only to discover a family that remembers the girl I once was, but refuses to accept the woman I’ve become” in a series of images that “reflect feelings of both metaphoric and literal isolation.” And Kyle Yearwood shows that social media and surreal self-portraiture can coalesce into an examination of “self-love, self-empowerment, and magic.”\n\n",
    "author": "Megan Burbank",
    "photocredit": "Courtesy of Kyle Yearwood",
    "region": "Seattle",
    "photo": "assets/wanawari.jpg",
    "cutline": "Kyle Yearwood’s work combines a surrealistic style with self-portraiture, social media and self-regard. His work will be on view in Wa Na Wari’s spring show.",
    "safety": "Masks required (N95s available on-site); limited to four visitors at a time, 45 minutes at a time, with a 30-minute gap in between for cleaning"
  },
  {
    "event": "Foothills Historical Museum",
    "TrevWork (combined exhibits and dates)": "Reopening planned for early May",
    "dates": "Reopening planned for early May",
    "category": "History",
    "price": "Free",
    "location": "130 N. River Ave., Buckley",
    "website_online": "cityofbuckley.com/museum",
    "phone": "360-829-1291",
    "hours": "Sunday 1-4 p.m., Tuesday-Thursday noon-4 p.m.",
    "vignette": "The Foothills Historical Museum in downtown Buckley, Pierce County, was started by veterinarian Jess Rose and his wife Maxine in 1981. Now run by their daughters Martha Olsen and Ann Gibson, plus an additional staff of a little over a dozen volunteers (including their cousin Nancy Stratton and Olsen’s husband Walt), the museum is dedicated to telling the stories of how people from small towns across the Carbon River Valley have spent their lives and celebrating the regional logging, mining and farming history.\n\nYou can view period rooms including a schoolroom, barber shop, general store, butcher shop, doctor’s office and more spread across three gallery areas. The museum is also home to thousands of historical photographs, a complete collection of the Buckley Banner newspaper from 1892-1970, and the Buckley/White River High School annual yearbooks from 1903-present. Volunteers will work with anyone looking to research their family history or answer general history questions about the area. Across the street from the main museum is a collection of relocated buildings including a lookout tower, saw shop and bunkhouse from the Scott Paper Company’s logging camp, a blacksmith shop, and a Washington state forestry guard station.\n\n ",
    "author": "Jackie Varriano",
    "photocredit": "Amanda Snyder / The Seattle Times",
    "region": "South",
    "photo": "assets/foothills.jpg",
    "cutline": "Foothills Historical Museum in Buckley, Pierce County, will reopen on May 1 — it’s been closed for the past year due to the pandemic. ",
    "safety": "Masks and social distancing required, some outdoor buildings may be closed"
  },
  {
    "event": "Museum of History & Industry (MOHAI)",
    "TrevWork (combined exhibits and dates)": "“Stand Up Seattle: The Democracy Project,” through July 5 ",
    "exhibitname": "“Stand Up Seattle: The Democracy Project” ",
    "dates": "“Stand Up Seattle: The Democracy Project” through July 5",
    "category": "History",
    "price": "$17-$22",
    "location": "860 Terry Ave., Seattle",
    "website_online": "mohai.org",
    "phone": "206-324-1126",
    "hours": "Thursday-Monday, 10 a.m.-5 p.m.",
    "vignette": "The oldest private heritage museum in Washington state, MOHAI has millions of artifacts from moments of local history: a Boeing B-1 biplane, the old neon Rainier brewery sign you used to be able to see driving on Interstate 5, a World War II-era periscope, a stuffed cougar donated by Eddie Bauer. Director Ann Farrington has described the museum as “not a timeline, but a series of stories strung like pearls.” Its rotating exhibition, “Stand Up Seattle: The Democracy Project,” is a collection of political artifacts (protest posters, bumper stickers, a sound system used by the Women’s City Club of Seattle, founded in 1922 by Mayor Bertha Knight Landes) as well as on-the-front-lines footage of Seattle’s 2020 protests shot by journalist Omari Salisbury and Converge Media. The exhibit also has a section curated by the high school students of MOHAI Youth Advisors, including artifacts from the 2019 Global Youth Climate Strike.\n\n",
    "author": "Brendan Kiley",
    "photocredit": "Courtesy of MOHAI ",
    "region": "Seattle",
    "photo": "assets/mohai.jpg",
    "cutline": "The Museum of History and Industry has interactive exhibits and millions of artifacts from Puget Sound history. ",
    "safety": "Timed tickets, masks and physical distancing required"
  },
  {
    "event": "Washington State History Museum",
    "TrevWork (combined exhibits and dates)": "“Crossing Boundaries: Portraits of a Transgender West,” May 29 through Dec. 12",
    "exhibitname": "“Crossing Boundaries: Portraits of a Transgender West”",
    "dates": "“Crossing Boundaries: Portraits of a Transgender West,” May 29 through Dec. 12",
    "category": "History",
    "price": "$11-$14",
    "location": "1911 Pacific Ave., Tacoma",
    "website_online": "washingtonhistory.org",
    "phone": "253-272-3500",
    "hours": "Tuesday-Sunday 10 a.m.-5 p.m.",
    "vignette": "There is no shortage of problematic monikers and conceptions about the West in the 1800s and 1900s. It’s been characterized as “wild” and “old,” as rugged and lawless. It’s been the domain of harmful stereotypes of Indigenous people and of a mythology about “proper” damsels and hypermasculine gunslingers. In the upcoming exhibit at Washington State History Museum,  “Crossing Boundaries: Portraits of a Transgender West,” curator and Washington State University history professor Peter Boag aims to reveal how gender identity wasn’t so straightforward as our popular depictions have led us to believe. The exhibit promises to tell the stories of people who reinvented themselves and their gender identities as they traveled west and of gender-fluid identities among the inhabitants who already called the West home. \n\n",
    "author": "Crystal Paul ",
    "photocredit": "Peter Boag / Washington State History Museum",
    "region": "South",
    "photo": "assets/wastatehistory.jpg",
    "cutline": "Jack Garland “Babe Bean,” who was born Elvira Virginia Mugarietta in San Francisco, 1869, was a Mexican American trans man, according to Peter Boag, curator and Washington State University history professor. His story will be featured in the “Crossing Boundaries: Portraits of a Transgender West” exhibition at Washington State History Museum.",
    "safety": "Masks or face coverings are required; social distancing, reduced occupancy and one-way gallery paths"
  },
  {
    "event": "National Nordic Museum",
    "TrevWork (combined exhibits and dates)": "“Among Forests and Lakes: Landscape Masterpieces from the Finnish National Gallery,” May 6 through Oct. 17",
    "exhibitname": "“Among Forests and Lakes: Landscape Masterpieces from the Finnish National Gallery”",
    "dates": "“Among Forests and Lakes: Landscape Masterpieces from the Finnish National Gallery,” May 6 through Oct. 17",
    "category": "Cultural",
    "price": "$18 adults, $15 seniors, students, $10 youth ages 5-18, free for children 4 and under; free first Thursday",
    "location": "2655 N.W. Market St., Seattle",
    "website_online": "nordicmuseum.org ",
    "phone": "206-789-5707",
    "hours": "Thursday-Sunday 10 a.m.-5 p.m.",
    "vignette": "With the pandemic limiting in-person interaction, Ballard’s National Nordic Museum has embraced virtual platforms inventively. Volunteers used Zoom to gather oral histories, documenting the virus’s fallout across the Nordic countries and the Northwest. And two months after the events of Jan. 6, the museum hosted an online lecture debunking hate groups’ appropriative misuse of Nordic symbols, a commonsense antidote to the widespread disinformation that catalyzed the attack.\n\nIn May, the museum (which reopened in February) returns to its roots, when it’ll be the only North American venue to host the crown jewels of Finland’s art world. “Among Forests and Lakes: Landscape Masterpieces from the Finnish National Gallery” features everything from 19th-century landscape paintings to Marja Helander’s contemporary short film “Birds in the Earth,” refracting the history of Finland’s Indigenous Sami people through two intrepid ballerinas dancing across frozen earth. It’s worth shutting your laptop and venturing out in person.",
    "author": "Megan Burbank",
    "photocredit": "Marja Helander and Mauri Lähdesm",
    "region": "Seattle",
    "photo": "assets/nordic.jpg",
    "cutline": "A still from Marja Helander’s 2017 short film “Birds in the Earth,” which interrogates ideas of ownership in the land of Finland’s Sami people through ballet. Helander’s work will be on view at the National Nordic Museum as part of its upcoming exhibition featuring work from the Finnish National Gallery.",
    "safety": "Face coverings required for everyone age 2 and up; advance tickets must be purchased online in advance; coat check closed"
  },
  {
    "event": "Suquamish Museum ",
    "TrevWork (combined exhibits and dates)": "“Chief Seattle Days,” April 9 through January 2022",
    "exhibitname": "“Chief Seattle Days”",
    "dates": "“Chief Seattle Days,” April 9 through January 2022",
    "category": "Cultural",
    "price": "$3 seniors 55 and older and children ages 6 to 17, $5 adults, $15 families",
    "location": "6861 N.E. South St,, Suquamish",
    "website_online": "suquamishmuseum.org",
    "phone": "360-394-8499",
    "hours": "Friday-Sunday, by appointment",
    "vignette": "As we look toward summer and the possibility of emerging from the lockdowns and tremendous loss of this past year, one event to look forward to is the annual Chief Seattle Days celebration. Dating back to 1911, Chief Seattle Days is a three-day festival celebrating Suquamish leader Chief Seattle, for whom Seattle is named, with dancing, canoe races, food and art vendors, festival royalty and a memorial service at Chief Seattle’s gravesite. The 2020 festival was canceled due to the pandemic. This year as the festival turns 110 years old, the “Chief Seattle Days” exhibit at the Suquamish Museum looks back to the origins of the festival, its hundred-year history and its significance to the Suquamish community today. The festival is typically held in August. If there will be a celebration this summer, the Suquamish Museum’s “Chief Seattle Days” exhibit is a great way to get a little more out of this year’s festival by learning about its history. \n\n",
    "author": "Crystal Paul ",
    "photocredit": "Courtesy of Suquamish Museum Archives",
    "region": "West",
    "photo": "assets/suquamish2.jpg",
    "cutline": "Chief Seattle Days circa 1920s, with Lucy Snyder Mulholland (center) and Amelia Sneatlum (right). ",
    "safety": "Masks and social distancing required, temperature check and questionnaire, and contact information must be provided for contact tracing"
  },
  {
    "event": "Wing Luke Museum",
    "TrevWork (combined exhibits and dates)": "“Where Beauty Lies,” through Sept. 19",
    "exhibitname": "“Where Beauty Lies”",
    "dates": "“Where Beauty Lies,” through Sept. 19",
    "category": "Cultural",
    "price": "$17",
    "location": "719 S. King Street, Seattle",
    "website_online": "wingluke.org ",
    "phone": "206-623-5124",
    "hours": "Friday-Sunday, 10 a.m.-5 p.m.",
    "vignette": "When the Wing Luke Museum reopened in March, it was just a few weeks before the hateful killing of six Asian American women in Atlanta. At the time, the museum was showing an exhibit (now closed) called “Hear Us Rise” that highlighted the organizing and empowerment efforts of Asian American and Pacific Islander women. Now the exhibit “Where Beauty Lies” takes up another aspect that plays a role in the marginalization of Asian American women — beauty standards and racist and misogynist stereotypes around Asian American beauty. \n\nFeaturing photos of stylish seniors from the online blog “Chinatown Pretty,” from the online campaign #UnfairandLovely, and even historical photos from beauty parlors at the incarceration camps of the 1940s, the exhibit casts a more inclusive gaze on Asian American beauty and examines the ways it has changed, harmed and helped throughout history.  \n\nLater this spring, the “Community Spread: How We Faced a Pandemic” exhibit will explore community stories and the ways Asian Pacific American communities came together during the pandemic from mutual aid to marching for justice. ",
    "author": "Crystal Paul ",
    "photocredit": "Courtesy of Wing Luke Museum",
    "region": "Seattle",
    "photo": "assets/wingluke.jpg",
    "cutline": "“Where Beauty Lies,” an exhibit at the Wing Luke Museum, looks at beauty standards and racist and misogynist stereotypes around Asian American beauty. ",
    "safety": "All guests 18 and older are required to sign a waiver of liability relating to the coronavirus/COVID-19"
  },
  {
    "event": "Burke Museum of Natural History and Culture",
    "TrevWork (combined exhibits and dates)": "n/a",
    "category": "Other",
    "price": "$14-$22",
    "location": "4300 15th Ave. N.E., Seattle",
    "website_online": "burkemuseum.org",
    "phone": "206-543-7907",
    "hours": "Tuesday-Sunday, 10 a.m.-5 p.m.",
    "vignette": "If you missed the hoopla in 2019, the 122-year-old Burke Museum got a new home — a museum turned inside-out with its labs, where bones are extracted from sediment and baskets are vacuumed of dust, visible to the public. Natural history museums are often about the dead, but the new Burke has also recommitted to the living with exhibitions about ecology, culture and politics that affect Indigenous people and natural resources.\n\nWhich isn’t to say the Burke doesn’t have plenty of artifacts: tiny fossils (including fossilized pollen), skeletons (dinosaurs, whales) and enormous libraries of objects (clothing, sculptures, tools) and creatures (spiders, flowers, birds, mammals). A good natural history museum is a reminder that everything has its place in the flood of time: that dandelion, that pigeon, that cup you just threw in the bin. After a walk through the Burke, you may pop out the exit door and find the world a little more alive than it was when you went in.",
    "author": "Brendan Kiley",
    "photocredit": "Alan Berner / The Seattle Times",
    "region": "Seattle ",
    "photo": "assets/burke.jpg",
    "cutline": "The Burke Museum has lots of interesting artifacts, including this composite skull of a plant-eating animal from 66 million years ago. Here, Peter Bateman, with his wife Leslie in the background, checks out a Triceratops exhibit at the museum.",
    "safety": "Timed tickets, masks and physical distancing required"
  },
  {
    "event": "MoPOP",
    "TrevWork (combined exhibits and dates)": "“Pearl Jam: Home and Away,” as of this writing, does not have a closing date; also of note: “Body of Work: Tattoo Culture,” through May 31; “Minecraft: The Exhibition,” through April 18 ",
    "exhibitname": "“Pearl Jam: Home and Away”",
    "category": "Other",
    "price": "$21-$30",
    "location": "325 Fifth Ave. N., Seattle",
    "website_online": "mopop.org",
    "phone": "206-770-2700",
    "hours": "Thursday-Monday, 10 a.m.-6 p.m.",
    "vignette": "Partnering with Pearl Jam archivist and videographer Kevin Shuss, “Pearl Jam: Home and Away” culls 200-plus artifacts, focusing on tour items and other memorabilia from the Seattle rock legends’ warehouse. It’s an intimate walk through Pearl Jam’s 30-year journey from its fabled precursor bands to the Rock & Roll Hall of Fame, with all the smashed guitar fragments, original lyric sheets and Jeff Ament’s colorful headwear choices along the way. Peep the old Seattle fliers that now read like fantasy lineups or the signs from defunct RKCNDY and Off Ramp clubs where PJ played its earliest gigs. If there’s a centerpiece to a collection this rich, it’s easily the towering bronze statue of Andrew Wood that Ament commissioned of his fallen Mother Love Bone mate, a heartfelt tribute made by local sculptor Mark Walker.\n\n",
    "author": "Michael Rietmulder",
    "photocredit": "Michael Rietmulder / The Seattle Times",
    "region": "Seattle ",
    "photo": "assets/mopop.jpg",
    "cutline": "MoPOP’s “Pearl Jam: Home and Away” exhibit culls 200-plus artifacts, focusing on tour items and other memorabilia from the Seattle rock legends’ warehouse.",
    "safety": "Reduced capacity, masks required for guests ages 3 and up, advance tickets and social distancing required, timed admittance"
  },
  {
    "event": "The Museum of Flight",
    "TrevWork (combined exhibits and dates)": "“Untold Stories: World War II at 75”",
    "exhibitname": "“Untold Stories: World War II at 75”",
    "category": "Other",
    "price": "$17-$25",
    "location": "9404 E. Marginal Way, Seattle",
    "website_online": "museumofflight.org",
    "phone": "206-764-5700",
    "hours": "Thursday-Sunday, 10 a.m.-5 p.m.",
    "vignette": "Aircraft enthusiasts can walk through aviation history at this museum at Boeing Field. Get a look at classic airliners built right here in Jet City and fighter planes used in both world wars, or learn about the people behind historical photos, missions and aviation technology in the commemorative “Untold Stories: World War II at 75” exhibit, which, according to MOHAI, offers the first enhancement in 16 years to the museum’s gallery of World War II fighter aircrafts and artifacts.\n\n",
    "author": "Michael Rietmulder",
    "photocredit": "Courtesy of the Museum of Flight",
    "region": "Seattle ",
    "photo": "assets/flight.jpg",
    "cutline": "The Museum of Flight’s Aviation Pavilion, located at Boeing Field. ",
    "safety": "Reduced capacity, timed entry, snugly fitting masks required, advance tickets recommended"
  },
  {
    "event": "Washington State Ski and Snowboard Museum ",
    "TrevWork (combined exhibits and dates)": "n/a",
    "category": "Other",
    "price": "Free",
    "location": "10 Pass Life Way, Snoqualmie Pass",
    "website_online": "wsssm.org",
    "phone": "425-434-0827",
    "hours": "Saturday-Sunday, noon-5 p.m.",
    "vignette": "Opened in 2015, the Washington State Ski & Snowboard Museum documents a rich local history of winter sports, from the state’s 39 Olympians to ski areas and gear. The museum is appropriately located right on Snoqualmie Pass, in between Dru Bru Brewery and Commonwealth Restaurant, so it’s easy to tack on after a day of skiing or snowboarding. For those not ready to visit in person, WSSSM now offers a free online series of talks; past speakers include Ski Patrol Rescue Team’s Chris Martin (and his working avalanche rescue dog Anna) and Deb Armstrong, who won gold in the giant slalom at the 1984 Winter Olympics in Sarajevo, Bosnia and Herzegovina (then Yugoslavia). Speaking of which: The museum is currently hosting a collection of memorabilia from Washington’s many Olympic and Paralympic athletes, including Armstrong’s medal.\n\nYou also don’t have to drive to the pass to see WSSSM’s offerings: In Seattle, you can see a mini-exhibit inside the Yurts at Canlis, and, starting in April, the museum will team up with the National Nordic Museum to host a joint exhibition on the history of ski jumping among early Nordic immigrants to America.",
    "author": "Megan Burbank",
    "photocredit": "Washington State Ski & Snowboard Museum",
    "region": "East",
    "photo": "assets/ski.jpg",
    "cutline": "At Snoqualmie Pass, the Washington State Ski & Snowboard Museum documents the state’s history of winter sports. ",
    "safety": "50% capacity limit, masks required"
  }
]