[
  {
    "event": "National Nordic Museum",
    "undefined": "“Among Forests and Lakes: Landscape Masterpieces from the Finnish National Gallery,” May 6 through Oct. 17",
    "exhibitname": "“Among Forests and Lakes: Landscape Masterpieces from the Finnish National Gallery”",
    "dates": "“Among Forests and Lakes: Landscape Masterpieces from the Finnish National Gallery,” May 6 through Oct. 17",
    "category": "Cultural",
    "price": "$18 adults, $15 seniors, students, $10 youth ages 5-18, free for children 4 and under; free first Thursday",
    "location": "2655 N.W. Market St., Seattle",
    "website_online": "nordicmuseum.org ",
    "phone": "206-789-5707",
    "hours": "Thursday-Sunday 10 a.m.-5 p.m.",
    "vignette": "<p>With the pandemic limiting in-person interaction, Ballard’s National Nordic Museum has embraced virtual platforms inventively. Volunteers used Zoom to gather oral histories, documenting the virus’s fallout across the Nordic countries and the Northwest. And two months after the events of Jan. 6, the museum hosted an online lecture debunking hate groups’ appropriative misuse of Nordic symbols, a commonsense antidote to the widespread disinformation that catalyzed the attack.</p>\n\n<p>In May, the museum (which reopened in February) returns to its roots, when it’ll be the only North American venue to host the crown jewels of Finland’s art world. “Among Forests and Lakes: Landscape Masterpieces from the Finnish National Gallery” features everything from 19th-century landscape paintings to Marja Helander’s contemporary short film “Birds in the Earth,” refracting the history of Finland’s Indigenous Sami people through two intrepid ballerinas dancing across frozen earth. It’s worth shutting your laptop and venturing out in person.</p>",
    "author": "Megan Burbank",
    "photocredit": "Marja Helander and Mauri Lähdesm",
    "region": "Seattle",
    "photo": "assets/nordic.jpg",
    "cutline": "A still from Marja Helander’s 2017 short film “Birds in the Earth,” which interrogates ideas of ownership in the land of Finland’s Sami people through ballet. Helander’s work will be on view at the National Nordic Museum as part of its upcoming exhibition featuring work from the Finnish National Gallery.",
    "safety": "Face coverings required for everyone age 2 and up; advance tickets must be purchased online in advance; coat check closed"
  },
  {
    "event": "Suquamish Museum ",
    "undefined": "“Chief Seattle Days,” April 9 through January 2022",
    "exhibitname": "“Chief Seattle Days”",
    "dates": "“Chief Seattle Days,” April 9 through January 2022",
    "category": "Cultural",
    "price": "$3 seniors 55 and older and children ages 6 to 17, $5 adults, $15 families",
    "location": "6861 N.E. South St,, Suquamish",
    "website_online": "suquamishmuseum.org",
    "phone": "360-394-8499",
    "hours": "Friday-Sunday, by appointment",
    "vignette": "<p>As we look toward summer and the possibility of emerging from the lockdowns and tremendous loss of this past year, one event to look forward to is the annual Chief Seattle Days celebration. Dating back to 1911, Chief Seattle Days is a three-day festival celebrating Suquamish leader Chief Seattle, for whom Seattle is named, with dancing, canoe races, food and art vendors, festival royalty and a memorial service at Chief Seattle’s gravesite. The 2020 festival was canceled due to the pandemic. This year as the festival turns 110 years old, the “Chief Seattle Days” exhibit at the Suquamish Museum looks back to the origins of the festival, its hundred-year history and its significance to the Suquamish community today. The festival is typically held in August. If there will be a celebration this summer, the Suquamish Museum’s “Chief Seattle Days” exhibit is a great way to get a little more out of this year’s festival by learning about its history.</p>\n\n",
    "author": "Crystal Paul ",
    "photocredit": "Courtesy of Suquamish Museum Archives",
    "region": "West",
    "photo": "assets/suquamish2.jpg",
    "cutline": "Chief Seattle Days circa 1920s, with Lucy Snyder Mulholland (center) and Amelia Sneatlum (right). ",
    "safety": "Masks and social distancing required, temperature check and questionnaire, and contact information must be provided for contact tracing"
  },
  {
    "event": "Wing Luke Museum",
    "undefined": "“Where Beauty Lies,” through Sept. 19",
    "exhibitname": "“Where Beauty Lies”",
    "dates": "“Where Beauty Lies,” through Sept. 19",
    "category": "Cultural",
    "price": "$17",
    "location": "719 S. King Street, Seattle",
    "website_online": "wingluke.org ",
    "phone": "206-623-5124",
    "hours": "Friday-Sunday, 10 a.m.-5 p.m.",
    "vignette": "<p>When the Wing Luke Museum reopened in March, it was just a few weeks before the hateful killing of six Asian American women in Atlanta. At the time, the museum was showing an exhibit (now closed) called “Hear Us Rise” that highlighted the organizing and empowerment efforts of Asian American and Pacific Islander women. Now the exhibit “Where Beauty Lies” takes up another aspect that plays a role in the marginalization of Asian American women — beauty standards and racist and misogynist stereotypes around Asian American beauty.</p>\n\n<p>Featuring photos of stylish seniors from the online blog “Chinatown Pretty,” from the online campaign #UnfairandLovely, and even historical photos from beauty parlors at the incarceration camps of the 1940s, the exhibit casts a more inclusive gaze on Asian American beauty and examines the ways it has changed, harmed and helped throughout history.</p>\n\n<p>Later this spring, the “Community Spread: How We Faced a Pandemic” exhibit will explore community stories and the ways Asian Pacific American communities came together during the pandemic from mutual aid to marching for justice.</p>",
    "author": "Crystal Paul ",
    "photocredit": "Courtesy of Wing Luke Museum",
    "region": "Seattle",
    "photo": "assets/wingluke.jpg",
    "cutline": "“Where Beauty Lies,” an exhibit at the Wing Luke Museum, looks at beauty standards and racist and misogynist stereotypes around Asian American beauty. ",
    "safety": "All guests 18 and older are required to sign a waiver of liability relating to the coronavirus/COVID-19"
  }
]