[
  {
    "event": "Foothills Historical Museum",
    "exhibitname": "Reopening planned for early May",
    "category": "History",
    "price": "Free",
    "location": "130 N. River Ave., Buckley",
    "website_online": "https://www.cityofbuckley.com/museum",
    "phone": "360-829-1291",
    "hours": "Sunday 1-4 p.m., Tuesday-Thursday noon-4 p.m.",
    "vignette": "<p>The Foothills Historical Museum in downtown Buckley, Pierce County, was started by veterinarian Jess Rose and his wife Maxine in 1981. Now run by their daughters Martha Olsen and Ann Gibson, plus an additional staff of a little over a dozen volunteers (including their cousin Nancy Stratton and Olsen’s husband Walt), the museum is dedicated to telling the stories of how people from small towns across the Carbon River Valley have spent their lives and celebrating the regional logging, mining and farming history.</p>\n\n<p>You can view period rooms including a schoolroom, barber shop, general store, butcher shop, doctor’s office and more spread across three gallery areas. The museum is also home to thousands of historical photographs, a complete collection of the Buckley Banner newspaper from 1892-1970, and the Buckley/White River High School annual yearbooks from 1903-present. Volunteers will work with anyone looking to research their family history or answer general history questions about the area. Across the street from the main museum is a collection of relocated buildings including a lookout tower, saw shop and bunkhouse from the Scott Paper Company’s logging camp, a blacksmith shop, and a Washington state forestry guard station.</p>\n\n ",
    "author": "Jackie Varriano",
    "photocredit": "Amanda Snyder / The Seattle Times",
    "region": "South",
    "photo": "assets/foothills.jpg",
    "cutline": "Foothills Historical Museum in Buckley, Pierce County, will reopen on May 1 — it’s been closed for the past year due to the pandemic. ",
    "safety": "Masks and social distancing required, some outdoor buildings may be closed"
  },
  {
    "event": "Museum of History & Industry (MOHAI)",
    "exhibitname": "“Stand Up Seattle: The Democracy Project,” through July 5 ",
    "category": "History",
    "price": "$17-$22",
    "location": "860 Terry Ave., Seattle",
    "website_online": "https://mohai.org/",
    "phone": "206-324-1126",
    "hours": "Thursday-Monday, 10 a.m.-5 p.m.",
    "vignette": "<p>The oldest private heritage museum in Washington state, MOHAI has millions of artifacts from moments of local history: a Boeing B-1 biplane, the old neon Rainier brewery sign you used to be able to see driving on Interstate 5, a World War II-era periscope, a stuffed cougar donated by Eddie Bauer. Director Ann Farrington has described the museum as “not a timeline, but a series of stories strung like pearls.” Its rotating exhibition, “Stand Up Seattle: The Democracy Project,” is a collection of political artifacts (protest posters, bumper stickers, a sound system used by the Women’s City Club of Seattle, founded in 1922 by Mayor Bertha Knight Landes) as well as on-the-front-lines footage of Seattle’s 2020 protests shot by journalist Omari Salisbury and Converge Media. The exhibit also has a section curated by the high school students of MOHAI Youth Advisors, including artifacts from the 2019 Global Youth Climate Strike.</p>\n\n",
    "author": "Brendan Kiley",
    "photocredit": "Courtesy of MOHAI ",
    "region": "Seattle",
    "photo": "assets/mohai.jpg",
    "cutline": "The Museum of History and Industry has interactive exhibits and millions of artifacts from Puget Sound history. ",
    "safety": "Timed tickets, masks and physical distancing required"
  },
  {
    "event": "Washington State History Museum",
    "exhibitname": "“Crossing Boundaries: Portraits of a Transgender West,” May 29 through Dec. 12",
    "category": "History",
    "price": "$11-$14",
    "location": "1911 Pacific Ave., Tacoma",
    "website_online": "https://www.washingtonhistory.org/",
    "phone": "253-272-3500",
    "hours": "Tuesday-Sunday 10 a.m.-5 p.m.",
    "vignette": "<p>There is no shortage of problematic monikers and conceptions about the West in the 1800s and 1900s. It’s been characterized as “wild” and “old,” as rugged and lawless. It’s been the domain of harmful stereotypes of Indigenous people and of a mythology about “proper” damsels and hypermasculine gunslingers. In the upcoming exhibit at Washington State History Museum,  “Crossing Boundaries: Portraits of a Transgender West,” curator and Washington State University history professor Peter Boag aims to reveal how gender identity wasn’t so straightforward as our popular depictions have led us to believe. The exhibit promises to tell the stories of people who reinvented themselves and their gender identities as they traveled west and of gender-fluid identities among the inhabitants who already called the West home. </p>\n\n",
    "author": "Crystal Paul ",
    "photocredit": "Peter Boag / Washington State History Museum",
    "region": "South",
    "photo": "assets/wastatehistory.jpg",
    "cutline": "Jack Garland “Babe Bean,” who was born Elvira Virginia Mugarietta in San Francisco, 1869, was a Mexican American trans man, according to Peter Boag, curator and Washington State University history professor. His story will be featured in the “Crossing Boundaries: Portraits of a Transgender West” exhibition at Washington State History Museum.",
    "safety": "Masks or face coverings are required; social distancing, reduced occupancy and one-way gallery paths"
  }
]