[
  {
    "event": "Cascadia Art Museum",
    "exhibitname": "“Dreaming Forms: The Art of Leo Kenney”;  “Stolen Moments: The Photography of Shedrich Williames”; all current exhibits run through May 23",
    "undefined": "“Dreaming Forms: The Art of Leo Kenney”;  “Stolen Moments: The Photography of Shedrich Williames”",
    "dates": "All current exhibits run through May 23",
    "category": "Visual Arts",
    "price": "$10 adults, $7 seniors, free for youth under 18 and students",
    "location": "190 Sunset Ave. S., Suite E, Edmonds",
    "website_online": "http://www.cascadiaartmuseum.org/",
    "phone": "425-336-4809",
    "hours": "Thursday-Sunday, noon-5 p.m.",
    "vignette": "<p>This Edmonds museum, a stone’s throw from the ferry, attracted much attention in 2019 for its exhibit “The Lavender Palette,” which featured work by early-to-mid-20th-century gay and lesbian artists from the Pacific Northwest. Curated by David Martin, the show was a groundbreaking exploration of regional culture through the work of gay creators.</p>\n\n<p>Reopened since February, the museum focuses on Northwest artists from 1860 through 1970. It is currently presenting “Dreaming Forms: The Art of Leo Kenney,” a collection of work from the acclaimed Northwest abstract painter (1925-2001), and “Stolen Moments: The Photography of Shedrich Williames,” the first solo exhibit from the long-based-in-Portland photographer. Also on view is a selection of work from the museum’s permanent collection, including several paintings by Guy Anderson (1906-1998) — himself an Edmonds native son.</p>",
    "author": "Moira Macdonald",
    "photocredit": "University of Washington Libraries, Special Collections",
    "region": "North",
    "photo": "assets/cascadia2.jpg",
    "cutline": "Shedrich Williames’ “Self Portrait” is part of the “Stolen Moments: The Photography of Shedrich Williames” exhibit at Cascadia Art Museum. ",
    "safety": "Masks and physical distancing required, no more than 50 patrons at a time",
    "TREV NOTES": "Exhibit names seem kinda problematic, many museums have far too many exhibitions to name"
  },
  {
    "event": "Frye Art Museum",
    "exhibitname": "“(Don’t Be Absurd) Alice in Parts” through April 25; “Unsettling Femininity” through May 30; “Art on the Mind” through Nov. 14",
    "undefined": "“(Don’t Be Absurd) Alice in Parts”; “Unsettling Femininity”; “Art on the Mind” ",
    "dates": "“(Don’t Be Absurd) Alice in Parts” through April 25; “Unsettling Femininity” through May 30; “Art on the Mind” through Nov. 14",
    "category": "Visual Arts",
    "price": "Free (timed ticket required)",
    "location": "704 Terry Ave., Seattle",
    "website_online": "https://fryemuseum.org/",
    "phone": "206-622-9250",
    "hours": "Thursday-Sunday, 11 a.m.-5 p.m.",
    "vignette": "<p>The venerable Frye first opened its doors in 1952, the legacy of Charles and Emma Frye, two local art patrons and prominent citizens who left their vast collection in perpetuity to the people of Seattle. In keeping with that spirit, admission to the Frye is always free; these days, however, you need a timed ticket.</p>\n\n<p>Now reopened in its longtime First Hill location, the Frye is offering new work from local interdisciplinary artist Anastacia-Reneé, whose 3D tour “(Don’t be Absurd) Alice in Parts” is described as “a rageful meditation on gentrification and its insidious effects on the body and home, as seen through the eyes of her multilayered character Alice Metropolis.” A former Seattle Civic Poet whose work examines racism, sexism, homophobia, ageism and class, Anastacia-Reneé designed this immersive exhibit to feel like a walk through Alice’s home. Also on display: “Unsettling Femininity,” drawn from the Frye’s collection of late-19th and early-20th-century paintings, examines how we look at women; “Art on the Mind: Ten Years of Creative Aging” celebrates the Frye’s decade of programs connecting people with dementia and their caregivers with art.</p>",
    "author": "Moira Macdonald",
    "photocredit": "Jueqian Fang",
    "region": "Seattle",
    "photo": "assets/frye.jpg",
    "cutline": "Installation view of Anastacia-Reneé’s “(Don’t be Absurd) Alice in Parts” at Frye Art Museum. ",
    "safety": "Timed tickets, masks and physical distancing required, coat check/cafe/shop closed, temperature checks and symptom screenings on entry"
  },
  {
    "event": "Greg Kucera Gallery",
    "exhibitname": "Exhibits of Jacob Lawrence’s and Joey Veltkamp’s works, through April 17",
    "undefined": "Jacob Lawrence and Joey Veltkamp",
    "dates": "Jacob Lawrence and Joey Veltkamp run through April 17 ",
    "category": "Visual Arts",
    "price": "Free ",
    "location": "212 Third Ave. S., Seattle",
    "website_online": "https://gregkucera.com/",
    "phone": "206-624-0770",
    "hours": "Tuesday-Saturday, 10:30 a.m.-5:30 p.m.",
    "vignette": "<p>We’ve written before about works by the rightly beloved Jacob Lawrence at Greg Kucera Gallery: the bold colors and iconic images of builders, families and snapshots from the life of Haitian revolutionary Toussaint Louverture. There’s no reason not to see those. </p>\n\n<p>Exuberant fabric works by local artist Joey Veltkamp are also currently hanging at Kucera. Veltkamp stitches life itself into his quilts: dread, humor, delight. The showstopper might be “Life Is Beautiful,” an enormous, pink blanket shouting “WE’RE ALL GONNA DIE” in black letters. But if you snuggle up close to the memento mori, you’ll find more hopeful messages in pink thread: “I will always love you,” “we are your friends,” etc. Other quilts feature sea gulls at Ivar’s, signs he sees around his home across the water in Bremerton (“come in for your free rose, Ben”) and a series of American-flag-themed quilts. One, “Self-Portrait as America,” features the stars and stripes unravelling — or on fire. He made that in 2020.</p>",
    "author": "Brendan Kiley",
    "photocredit": "Courtesy of Greg Kucera Gallery",
    "region": "Seattle",
    "photo": "assets/kucera2.jpg",
    "cutline": "The quilts and fabric art of Joey Veltkamp, currently hanging at Greg Kucera Gallery, include a series of meditations on American flags — some waving in celebration and some in distress.",
    "safety": "Masks and physical distancing required"
  },
  {
    "event": "MadArt\n\n",
    "exhibitname": "“Parable of Gravity,” through April 17  ",
    "undefined": "“Parable of Gravity” ",
    "dates": "“Parable of Gravity” through April 17",
    "category": "Visual Arts",
    "price": "Free (timed tickets required)",
    "location": "325 Westlake Ave. N., Suite 101, Seattle",
    "website_online": "http://madartseattle.com/",
    "phone": "206-623-1180",
    "hours": "Monday-Saturday 10 a.m.-4 p.m.",
    "vignette": "<p>MadArt is a big room in South Lake Union where, every few months, an artist (or a team) makes the kind of ambitious installations you don’t tend to see elsewhere. Descriptions only get you so far (you can describe what a roller coaster looks like, but will fail to communicate the feeling of being one grain in a whirlwind), but let’s try: “Aperture” by Ian McMahon was a 15-foot-tall plaster pillow trying to burst through a wood frame. “Each and Every” by Beili Liu, with its hundreds of children’s clothes coated in cement and suspended above the floor (a comment on children trapped in limbo at the U.S./Mexico border) was deep and dissonant, like a graveyard for infants, or a requiem played on recorders and toy pianos. MadArt’s current exhibition is “Parable of Gravity” by Casey Curran, whose work has been at the Guggenheim, onstage with provocateurs Saint Genet, and on the runway at 2021 Paris Haute Couture Week. Curran’s parable is of catastrophe and rebirth: spare wood towers in various stages of rot; a giant metal meteor with a Gothic cathedral’s rose window; and feathery white animatronic plants (or are they fungus?) barnacled on the crumbling high-rises, slowly opening and closing, like they’re supplicating to the incoming space rock, or talking to each other. If you read Curran’s creation as a vision of an eviscerated city, the parable is terrifying — but if you can step outside your anthropocentrism, it’s beautiful. What strange beings will thrive on our bones?</p>\n\n\n\n",
    "author": "Brendan Kiley",
    "photocredit": "James Harnois and MadArt",
    "region": "Seattle",
    "photo": "assets/madart.jpg",
    "cutline": "The impressive “Parable of Gravity,” at MadArt Studio, is a large-scale installation of buildings in decay, an approaching meteor and masses of animatronic flowerlike creatures slowly opening and closing. ",
    "safety": "Timed tickets, masks and physical distancing required, groups limited to 15"
  },
  {
    "event": "Martyr Sauce",
    "exhibitname": "New space opening May 6, 2021; upcoming exhibit featuring muralist Kenji Stoll, dates and title forthcoming",
    "dates": "New space opening May 6, 2021",
    "category": "Visual Arts",
    "price": "$5",
    "location": "108 S. Jackson St., Seattle",
    "website_online": "https://www.martyrsauce.com/",
    "phone": "contact@martyrsauce.com",
    "hours": "Thursday-Saturday by appointment",
    "vignette": "<p>With her colorful, larger-than-life installations, Tariqa Waters — artist, curator and founder of the gallery Martyr Sauce — is always one to watch. And that’s about to get a whole lot easier now that Martyr Sauce is relaunching in a new space this May. The new space is above ground (as opposed to the original, very cool but underground space in Pioneer Square) and features large windows which Waters says she’ll take full advantage of by curating and creating large enticing installations that you’ll be able to enjoy from the street. (The original Martyr Sauce space will have new programming, too, after the pandemic eases.) In the new space, Waters will commission artists in collaborative works that she calls “transformative and immersive experiences through public engagement.” First up is Tacoma-based visual artist and muralist Kenji Stoll. “You won’t have to enter the space,” said Waters. “You can soak it up from the street and when you come inside, it’s a treat.”</p>\n\n",
    "author": "Crystal Paul ",
    "photocredit": "Dean Rutz / The Seattle Times",
    "region": "Seattle",
    "photo": "assets/martyrsauce.jpg",
    "cutline": "Tariqa Waters, artist, curator, and owner of Martyr Sauce art gallery in Pioneer Square, which is expanding its footprint. ",
    "safety": "Masks required"
  },
  {
    "event": "Museum of Glass",
    "exhibitname": "“Transparency,” through summer; “René Lalique: Art Deco Gems from the Steven and Roslyn Shulman Collection,” through fall; “Counterparts,” as of this writing, does not have a closing date ",
    "undefined": "“Transparency”; “René Lalique: Art Deco Gems from the Steven and Roslyn Shulman Collection”; “Counterparts”",
    "dates": "“Transparency” shows through summer; “René Lalique” through fall; “Counterparts,” as of this writing, does not have a closing date ",
    "category": "Visual Arts",
    "price": "$17 adults, $14 seniors/students/military, $5 12 and under; ",
    "location": "1801 Dock St., Tacoma",
    "website_online": "https://www.museumofglass.org/",
    "phone": "253-284-4750  ",
    "hours": "Friday-Sunday 10 a.m.-5 p.m.",
    "vignette": "<p>Art glass is the delicious candy of the museum world; colorful, shiny, accessible and oddly soothing, like magic icicles. Tacoma’s Museum of Glass, which reopened April 3, puts art glass and glassmaking at center stage, letting its beautifully lit wares sparkle. It’ll feature three exhibits this spring: “Transparency,” a collection of glassworks created by LGBTQ+ artists (created by the National Liberty Museum in Philadelphia for Pride Month 2017); a delicate assortment of nearly 200 art deco objects from the French artist René Lalique; and “Counterparts: Glass + Art Elements,” in which glass and nonglass works are juxtaposed to illustrate common themes.</p>\n\n",
    "author": "Moira Macdonald",
    "photocredit": "Courtesy of Museum of Glass",
    "region": "South",
    "photo": "assets/glass.jpg",
    "cutline": "“René Lalique: Art Deco Gems from the Steven and Roslyn Shulman Collection” at Museum of Glass in Tacoma includes nearly 200 art deco objects from the French artist René Lalique. ",
    "safety": "Masks and physical distancing required, staggered entry may be implemented, Education Studio closed"
  },
  {
    "event": "Seattle Art Museum",
    "exhibitname": "“Jacob Lawrence: The American Struggle,” through May 23; “Barbara Earl Thomas: The Geography of Innocence,” through Jan. 2, 2022; “Dawn Cerny: Les Choses,” April 9 through Sept. 26; “Monet at Étretat,” June 25 through Oct. 17",
    "undefined": "“Jacob Lawrence: The American Struggle”; “Barbara Earl Thomas: The Geography of Innocence”; “Dawn Cerny: Les Choses”; “Monet at Étretat”",
    "dates": "“The American Struggle” through May 23; “The Geography of Innocence” through Nov. 14; “Les Choses,” April 9 through Sept. 26; “Monet at Étretat,” June 25 through Oct. 17",
    "category": "Visual Arts",
    "price": "$19.99 adults, $17.99 seniors 65 and over and military, $12.99 teens and students, free for SAM members, children 14 and under, free on first Thursday of each month",
    "location": "1300 First Ave., Seattle",
    "website_online": "https://seattleartmuseum.org/",
    "phone": "206-654-3100",
    "hours": "Friday-Sunday 10 a.m.-5 p.m., First Free Thursday 10 a.m.-5p.m.",
    "vignette": "<p>If you need an injection of art appreciation posthaste, Seattle Art Museum has a wealth of fantastic shows on view, from celebrated artists with ties to Seattle. “Jacob Lawrence: The American Struggle” is frequently sold-out, and for good reason. For the first time since 1958, the exhibition reunites Lawrence’s iconic series “Struggle: From the History of the American People,” and its quasi-abstract epic of American history told through the eyes of folks previously pushed to the margins. Also on view is Barbara Earl Thomas’ stunning “The Geography of Innocence.” Through cut-paper portraits and an immersive installation, the show invites viewers to reflect on childhood, race, violence, hope, ritual and their own lives and potential for change.</p>\n\n<p>In June, “Monet at Étretat” presents a chance to immerse yourself in the impressionist’s French coastal town without stepping on a plane; and sculptures from Dawn Cerny in the exhibition “Les Choses” examine “the gap between our ideal homes and the lived reality of our overgrown, patched-up, and slightly worn habitats,” something that couldn’t be more timely after a year spent getting intimately acquainted with our own slightly worn habitats.\n(SAM’s Asian Art Museum reopens to the public on May 28, and to SAM members on May 7. Its Olympic Sculpture Park is open, though the PACCAR Pavilion at the park remains closed.)</p>",
    "author": "Megan Burbank",
    "photocredit": "Courtesy of Seattle Art Museum",
    "region": "Seattle",
    "photo": "assets/sam.jpg",
    "cutline": "In June, SAM’s “Monet at Étretat” presents a chance to immerse yourself in the impressionist’s French coastal town without stepping on a plane. ",
    "safety": "Timed tickets, masks and physical distancing required, capacity limits (some galleries closed), coat check closed"
  },
  {
    "event": "Tacoma Art Museum",
    "exhibitname": "“Immigrant Artists”; “Painting Deconstructed”; as of this writing, neither exhibition has a closing date",
    "undefined": "“Immigrant Artists”; “Painting Deconstructed”",
    "dates": "“Immigrant Artists” and “Painting Deconstructed,” as of this writing, do not have closing dates",
    "category": "Visual Arts",
    "price": "$18 adults, $15 students/seniors, free for military and children 5 and under",
    "location": "1701 Pacific Ave., Tacoma",
    "website_online": "https://www.tacomaartmuseum.org/",
    "phone": "253-272-4258",
    "hours": "Friday-Sunday, 10 a.m.-5 p.m.",
    "vignette": "<p>Founded in 1935, Tacoma’s largest museum has a permanent collection of more than 5,000 works. Reopening on April 16, it will have a variety of exhibits on display. “Immigrant Artists and the American West” examines how immigrant experiences are shaped by art; its artists, arriving in the 19th and 20th centuries, come from China, Denmark, England, France, Germany, Japan, Mexico and Russia, among other countries. “Painting Deconstructed: Selections from the Northwest Collection” is made of work by Black and Indigenous artists, artists of color, and women artists, divided into sections highlighting four key aspects of painting: medium and support, composition, color, and technique. There’s also a permanent Dale Chihuly glasswork collection, an array of outdoor sculptures, and “South Sound Selects: Community Choices from the Collection,” in which members of the South Sound community served as guest curators and chose their favorite works to display. </p>\n\n",
    "author": "Moira Macdonald",
    "photocredit": "Courtesy of Tacoma Art Museum",
    "region": "South",
    "photo": "assets/tacoma.jpg",
    "cutline": "“Gymnasium,” an oil painting by Kenjiro Nomura (1896-1956), is part of the “Immigrant Artists and the American West” exhibit on display at Tacoma Art Museum, reopening April 16. ",
    "safety": "Masks and physical distancing required; Art Studio, TAM Cafe, coat check and hands-on exhibits temporarily closed; museum store restricted to 10 visitors"
  },
  {
    "event": "Wa Na Wari",
    "exhibitname": "Exhibits of Carletta Carrington Wilson’s, Lisa Myers Bulmash’s, Mia Imani’s, Shoccara Marcus’s and Kyle Yearwood’s works, through July 18",
    "undefined": "Carletta Carrington Wilson; Lisa Myers Bulmash; Mia Imani; Shoccara Marcus; Kyle Yearwood  ",
    "dates": "Carletta Carrington Wilson, Lisa Myers Bulmash, Mia Imani, Shoccara Marcus and Kyle Yearwood exhibits through July 18",
    "category": "Visual Arts",
    "price": "Free",
    "location": "911 24th Ave., Seattle",
    "website_online": "https://www.wanawari.org/",
    "phone": "206-485-7563",
    "hours": "By appointment",
    "vignette": "<p>Housed in a fifth-generation Black-owned home in the Central District, Wa Na Wari showcases work from Black artists in a multidisciplinary space that invites (and rewards) deep engagement. This spring’s offerings bring a strongly felt sense of place and history, from Carletta Carrington Wilson’s mixed-media “night of the stereotypes,” in which 19th- and 20th-century caricatures interrogate the work of their racist creators, to collage and book artist Lisa Myers Bulmash’s “The Memory Palace,” which pushes back against the normative idea that COVID-19 is truly novel: “How can this be ‘an unprecedented moment in history’ when Black people have seen — and survived — even worse? We are so often the first to be hit by tragedy.” In “Choreographing My Past,” Shoccara Marcus documents the dissonance of returning to her childhood home after a decade away “only to discover a family that remembers the girl I once was, but refuses to accept the woman I’ve become” in a series of images that “reflect feelings of both metaphoric and literal isolation.” And Kyle Yearwood shows that social media and surreal self-portraiture can coalesce into an examination of “self-love, self-empowerment, and magic.”</p>\n\n",
    "author": "Megan Burbank",
    "photocredit": "Courtesy of Kyle Yearwood",
    "region": "Seattle",
    "photo": "assets/wanawari2.jpg",
    "cutline": "Kyle Yearwood’s work combines a surrealistic style with self-portraiture, social media and self-regard. His work will be on view in Wa Na Wari’s spring show.",
    "safety": "Masks required (N95s available on-site); limited to four visitors at a time, 45 minutes at a time, with a 30-minute gap in between for cleaning"
  }
]